In [2]:
import pandas as pd

+ **Tweets**: company_tweet and tweet files need to be smaller;
+ **Stocks**: only TSLA, AMZN, GOOGL, AAPL and FB should be kept.

# Tweets

In [3]:
file1=r"datasets\tweets\Tweet.csv"
file2=r"datasets\tweets\Company_Tweet.csv"

In [4]:
test_df=pd.read_csv(file1, nrows=5)
test_df.columns

Index(['tweet_id', 'writer', 'post_date', 'body', 'comment_num', 'retweet_num',
       'like_num'],
      dtype='object')

In [5]:
test_df=pd.read_csv(file2, nrows=5)
test_df.columns

Index(['tweet_id', 'ticker_symbol'], dtype='object')

In [6]:
#chunk_size=400000
#batch_no=0
#for chunk in pd.read_csv(file1, chunksize=chunk_size):
#    batch_no+=1
#    chunk.to_csv(r'datasets\tweets\Tweet\Tweet_' + str(batch_no) + '.csv', index=False)
#    
#print('All done!', batch_no-1, 'files were created.')

All done! 10 files were created.

In [24]:
#chunk_size=3000000
#batch_no=0
#for chunk in pd.read_csv(file2, chunksize=chunk_size):
#    batch_no+=1
#    chunk.to_csv(r'datasets\tweets\Company_Tweet\Company_Tweet_' + str(batch_no) + '.csv', index=False)
#    
#print('All done!', batch_no-1, 'files were created.')

All done! 2 files were created.

# Stocks

In [24]:
file=r"datasets/nasdaq/nasdaq_historical_prices_daily/nasdaq_historical_prices_daily.csv"

In [25]:
test_df=pd.read_csv(file, nrows=5)
test_df.columns

Index(['ticker', 'date', 'open', 'high', 'low', 'close', 'volume'], dtype='object')

In [29]:
chunk_size=2000000
batch_no=0
for chunk in pd.read_csv(file, chunksize=chunk_size):
    batch_no+=1
    chunk.to_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_' + str(batch_no) + '.csv', 
                 index=False)
    
print('All done!', batch_no, 'files were created.')

All done! 9 files were created.

In [32]:
#df1=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_1.csv')
#df2=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_2.csv')
#df3=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_3.csv')
#df4=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_4.csv')
#df5=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_5.csv')
#df6=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_6.csv')
#df7=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_7.csv')
#df8=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_8.csv')
#df9=pd.read_csv(r'datasets\nasdaq\nasdaq_historical_prices_daily\datachunks\nasdaq_9.csv')

In [41]:
appl_df1=[]
for i in df1.index:
    if df1['ticker'][i]=='AAPL':
        appl_df1.append(i)
        
appl_df1[:5]

[0, 1, 2, 3, 4]

In [42]:
len(appl_df1)

5033

In [55]:
aapl=df1.iloc[appl_df1]
aapl.head(3)

  ticker        date    open    high       low   close    volume
0   AAPL  2020-02-06  322.57  325.22  320.2648  325.21  26214054
1   AAPL  2020-02-05  323.52  324.76  318.9500  321.45  29384908
2   AAPL  2020-02-04  315.31  319.64  313.6345  318.85  34154134

In [61]:
aapl.to_csv(r'datasets/nasdaq/AAPL.csv', index=False)

In [62]:
tsla_df1=[]
for i in df1.index:
    if df1['ticker'][i]=='TSLA':
        tsla_df1.append(i)
        
len(tsla_df1)

2419

In [63]:
tsla=df1.iloc[tsla_df1]
tsla.head(3)

       ticker        date    open      high       low   close    volume
245534   TSLA  2020-02-06  699.92  795.8300  687.0000  748.96  39850221
245535   TSLA  2020-02-05  823.26  845.9800  704.1106  734.70  48128154
245536   TSLA  2020-02-04  882.96  968.9899  833.8800  887.06  60938758

In [64]:
tsla.to_csv(r'datasets/nasdaq/TSLA.csv', index=False)

In [51]:
googl_df1=[]
for i in df1.index:
    if df1['ticker'][i]=='GOOGL':
        googl_df1.append(i)
        
len(googl_df1)

[15099, 15100, 15101, 15102, 15103]

In [65]:
googl=df1.iloc[googl_df1]
googl.head(3)

      ticker        date     open     high      low    close   volume
15099  GOOGL  2020-02-06  1451.98  1481.56  1450.48  1475.97  1889369
15100  GOOGL  2020-02-05  1463.61  1464.58  1429.67  1446.05  1816252
15101  GOOGL  2020-02-04  1454.49  1467.34  1422.03  1445.41  4793967

In [68]:
googl.to_csv(r'datasets/nasdaq/GOOGL.csv', index=False)

In [69]:
amzn_df1=[]
for i in df1.index:
    if df1['ticker'][i]=='AMZN':
        amzn_df1.append(i)
        
len(amzn_df1)

5033

In [72]:
amzn=df1.iloc[amzn_df1]
amzn.head(3)

      ticker        date     open     high        low    close   volume
10066   AMZN  2020-02-06  2041.02  2056.30  2024.8001  2050.23  3176484
10067   AMZN  2020-02-05  2071.02  2071.02  2032.0000  2039.87  4253068
10068   AMZN  2020-02-04  2029.88  2059.80  2015.3700  2049.67  5289338

In [73]:
amzn.to_csv(r'datasets/nasdaq/AMZN.csv', index=False)

In [74]:
msft_df1=[]
for i in df1.index:
    if df1['ticker'][i]=='MSFT':
        msft_df1.append(i)
        
len(msft_df1)

5033

In [76]:
msft=df1.iloc[msft_df1]
msft.head(3)

     ticker        date    open      high       low   close    volume
5033   MSFT  2020-02-06  180.97  183.8199  180.0590  183.63  27699794
5034   MSFT  2020-02-05  184.03  184.2000  178.4101  179.90  38730789
5035   MSFT  2020-02-04  177.14  180.6400  176.3100  180.12  36433339

In [77]:
msft.to_csv(r'datasets/nasdaq/MSFT.csv', index=False)

In [75]:
msft_df2=[]
for i in df2.index:
    if df2['ticker'][i]=='MSFT':
        msft_df2.append(i)
        
len(msft_df2)

0

In [83]:
top5_prices=pd.concat([aapl,amzn,googl,tsla,msft]).sort_values(by=['ticker','date']).reset_index(drop=True)
top5_prices.head()

  ticker        date    open    high     low   close   volume
0   AAPL  2000-02-04  103.94  110.00  103.62  108.00  3797500
1   AAPL  2000-02-07  108.00  114.25  105.94  114.06  3938100
2   AAPL  2000-02-08  114.00  116.12  111.25  114.87  3648600
3   AAPL  2000-02-09  114.12  117.12  112.44  112.62  2672900
4   AAPL  2000-02-10  112.87  113.87  110.00  113.50  2705200

In [84]:
top5_prices.to_csv(r'datasets/nasdaq/top5_prices.csv', index=False)

In [94]:
# ver se existem estes tickers noutros dfs
dfs=[df1,df2,df3,df4,df5,df6,df7,df8,df9]
tickers=['AAPL','TSLA','MSFT','GOOGL','AMZN']
for i in range(len(dfs)):
    for ticker in tickers:
        if ticker in dfs[i]['ticker'].unique():
            print(ticker, i)

AAPL 0
TSLA 0
MSFT 0
GOOGL 0
AMZN 0